Repository: maibank/cs-cart
Catalog: var/langs/*/addons/maib.po
Languages: ro, ru

# Languages::maib.debug_log
source: Debug log all requests to var folder
ro: Înregistrează toate solicitările în folderul var
ru: Отладка всех запросов в папку var

# Languages::maib.private_key
source: Path to the private key PEM file
ro: Calea către fișierul PEM cu cheie privată
ru: Путь к PEM файлу с закрытым ключом

# Languages::maib.pkey_pass
source: Private key password
ro: Parola pentru cheia privată
ru: Пароль закрытого ключа

# Languages::maib.public_key
source: Path to the certificate PEM file containing public key
ro: Calea către fișierul PEM care conține cheie publică
ru: Путь к PEM-файлу сертификата

# Languages::maib.transaction_type
source: Transaction type
ro: Tipul tranzacției
ru: Тип операции

# Languages::maib.capture
source: Capture (capture payment immediately after customer's approval)
ro: Capturare (captarea plății imediat după aprobarea clientului)
ru: Захват (захват платежа сразу после одобрения клиента)

# Languages::maib.authorize
source: Authorize (requires manual or automated capture after checkout)
ro: Autorizare (necesită captare manuală sau automată după efectuarea plății)
ru: Авторизовать (требует ручного или автоматического захвата после оформления заказа)

# Languages::maib.addon_is_disabled
source: Addon is disabled
ru: Аддон отключен

# Languages::remote_status
source: Remote status
ru: Удаленный статус

# Languages::maib.return_urls
source: Return and cancel URLs to be provided to bank
ro: Adresele URL pentru returnare si anulare care vor fi furnizate către bancă
ru: URL возврата и отмены, которые будут предоставлены банку

# Languages::maib.delete_keys
source: Delete all keys and passwords stored on server
ro: Ștergeți toate cheile și parolele stocate pe server
ru: Удалить все ключи и пароли, хранящиеся на сервере

# Languages::maib.delete_warning
source: WARNING: this will remove existing PEM files and password from server!
ro: AVERTIZARE: aceasta va elimina fișierele PEM și parola existente de pe server!
ru: ВНИМАНИЕ: это удалит существующие файлы PEM и пароль с сервера!

# Languages::maib.pem_settings
source: PEM keys settings
ro: Setările cheilor PEM
ru: Настройки ключей PEM

# Languages::maib.auto_pfx_extract
source: Auto extract PFX file
ro: Extragerea automată a fișierului PFX
ru: Автоматическое извлечение файла PFX

# Languages::maib.auto_pfx_text
source: If only PFX file available it can be used to extract PEM keys
ro: Dacă este disponibil doar fișierul PFX, acesta poate fi utilizat pentru a extrage cheile PEM
ru: Если доступен только файл PFX, его можно использовать для извлечения ключей PEM.

# Languages::maib.auto_pfx_warning
source: WARNING: this will overwrite existing PEM files and password!
ro: AVERTIZARE: aceasta va suprascrie fișierele PEM și parola existente!
ru: ВНИМАНИЕ: это перезапишет существующие файлы PEM и пароль!

# Languages::maib.auto_pfx_file
source: PFX file
ro: Fișier PFX
ru: Файл PFX

# Languages::maib.auto_pfx_pass
source: PFX password
ro: Parola PFX
ru: Пароль PFX

# Languages::maib.private_note
source: Note: if curl is using NSS private key should be in PKCS#1 format, RSA + 3DES encryption
ro: Notă: dacă curl utilizează NSS cheia privată ar trebui să fie în format PKCS#1, RSA + criptare 3DES
ru: Примечание: если curl использует NSS, закрытый ключ должен быть в формате PKCS#1, RSA + 3DES шифрование.

# Languages::maib.reverse_label
source: Reverse payment
ro: Returnare plată
ru: Обратный платеж

# Languages::maib.reverse_link
source: Reverse payment amount
ro: Pagina returnare plată
ru: Обратная сумма платежа

# Languages::maib.invalid_amount
source: Invalid amount
ro: Sumă incorectă
ru: Недопустимая сумма

# Languages::maib.amount_to_reverse
source: Amount to reverse
ro: Suma returnată
ru: Сумма

# Languages::maib.reverse_amount
source: Reverse amount
ro: Returnează suma
ru: Вернуть сумму

# Languages::maib.payment_not_yours
source: This payment was not made for your company
ro: Această plată nu a fost efectuată către compania dvstră
ru: Этот платеж не был сделан для вашей компании

# Languages::maib.check_payment_status
source: Check payment status
ro: Verifică statut plată
ru: Проверить статус оплаты
